_posts/2022-01-12-iptime-a3000a2-ubuntu16.04.html
---
title: IPTime A3000UA-2 Ubuntu 16.04 드라이버 설치
tags: LinuxDeviceDriver
toc: true
toc_sticky: true
---

<div id="outline-container-org9383f4d" class="outline-2">
<h2 id="org9383f4d">IPTime A3000UA-2 Ubuntu 16.04 드라이버 설치</h2>
<div class="outline-text-2" id="text-org9383f4d">
<ul class="org-ul">
<li>desktop 컴퓨터에 무선랜 driver가 안깔려 있음.</li>
<li>무선랜카드를 구입하면서, 리눅스용으로 드라이버 설치 필요</li>
<li>다행히 한글로 된 가이드가 구글링 결과에 많이 나옴.</li>
<li>그중 설명이 잘 된 가이드 이용함</li>
</ul>
</div>
</div>

<div id="outline-container-orga86ef27" class="outline-2">
<h2 id="orga86ef27">순서</h2>
<div class="outline-text-2" id="text-orga86ef27">
<pre class="example">

~/work$ git clone https://github.com/cilynx/rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959     .... (1)

'rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959'에 복제합니다...
remote: Enumerating objects: 752, done.
remote: Counting objects: 100% (12/12), done.
remote: Compressing objects: 100% (12/12), done.
remote: Total 752 (delta 3), reused 6 (delta 0), pack-reused 740
오브젝트를 받는 중: 100% (752/752), 3.63 MiB | 0 bytes/s, 완료.
델타를 알아내는 중: 100% (254/254), 완료.
연결을 확인하는 중입니다... 완료.
~/work$ cd  rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959
~/work/rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959$ ls
Kconfig   README.md  core       hal          include  platform     runwpa
Makefile  clean      dkms.conf  ifcfg-wlan0  os_dep   rtl8822b.mk  wlan0dhcp

~/work/rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959$ sudo apt install dkms                 ..... (2)

containerd.io docker-ce-cli libbonoboui2-0 libbonoboui2-common libgnomecanvas2-0 libgnomecanvas2-common libgnomeui-0
libgnomeui-common libjansson4
Use 'sudo apt autoremove' to remove them.
dkms
0개 업그레이드, 1개 새로 설치, 0개 제거 및 143개 업그레이드 안 함.
66.4 k바이트 아카이브를 받아야 합니다.
이 작업 후 267 k바이트의 디스크 공간을 더 사용하게 됩니다.
받기:1 http://kr.archive.ubuntu.com/ubuntu xenial-updates/main amd64 dkms all 2.2.0.3-2ubuntu11.8 [66.4 kB]
내려받기 66.4 k바이트, 소요시간 1초 (56.1 k바이트/초)
Selecting previously unselected package dkms.
(데이터베이스 읽는중 ...현재 530797개의 파일과 디렉터리가 설치되어 있습니다.)
Preparing to unpack .../dkms_2.2.0.3-2ubuntu11.8_all.deb ...
Unpacking dkms (2.2.0.3-2ubuntu11.8) ...
Processing triggers for man-db (2.7.5-1) ...
dkms (2.2.0.3-2ubuntu11.8) 설정하는 중입니다 ...
~/work/rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959$ cd ..
~/work$ sudo dkms add ./rtl88x2BU_WiFi_linux_v5.3.1_27678.20180430_COEX20180427-5959

Creating symlink /var/lib/dkms/rtl88x2bu/5.3.1/source -&gt;
/usr/src/rtl88x2bu-5.3.1

DKMS: add completed.
~/work$ sudo dkms install -m rtl88x2bu -v 5.3.1                                                            ..... (3)

Kernel preparation unnecessary for this kernel.  Skipping...

Building module:
cleaning build area....
make KERNELRELEASE=4.4.0-210-generic KVER=4.4.0-210-generic src=/usr/src/rtl88x2bu-5.3.1..................................
cleaning build area....

DKMS: build completed.

88x2bu.ko:
Running module version sanity check.
- Original module
- No original module exists within this kernel
- Installation
- Installing to /lib/modules/4.4.0-210-generic/updates/dkms/

depmod......

DKMS: install completed.
~/work$ sudo modprobe 88x2bu                                                                               ..... (4)
~/work$ lsmod | grep 88x2bu                                                                                ..... (5)
88x2bu               2605056  0
cfg80211              565248  1 88x2bu
~/work$
</pre>
</div>
</div>



<div id="outline-container-org5cbbf00" class="outline-2">
<h2 id="org5cbbf00">랜카드 잡기</h2>
<div class="outline-text-2" id="text-org5cbbf00">
<ul class="org-ul">
<li><a href="https://linsoo.pe.kr/archives/15553">https://linsoo.pe.kr/archives/15553</a></li>
<li>이대로 하기</li>
<li>ESSID와 SSID가 같았음</li>
</ul>

<pre class="example">
$ cat /etc/network/interfaces
source /etc/network/interfaces.d/*

auto lo
iface lo inet loopback

auto WIRELESS_LAN_NAME
iface WIRELESS_LAN_NAME inet dhcp
wpa-ssid KT_xxxxxxx
wpa-key_mgmt WPA-PSK KT_xxxxxx
wpa-psk 암호
</pre>
<ul class="org-ul">
<li>reboot하면 무선랜이 잡힘</li>
</ul>
</div>
</div>
<div id="outline-container-org1b9eca4" class="outline-2">
<h2 id="org1b9eca4">참고 링크</h2>
<div class="outline-text-2" id="text-org1b9eca4">
<ul class="org-ul">
<li>device driver 설치 : <a href="https://simryang.tistory.com/m/entry/%EB%AC%B4%EC%84%A0-%EB%9E%9C%EC%B9%B4%EB%93%9C-IPTime-A3000UA-2-Ubuntu-1604-%EB%93%9C%EB%9D%BC%EC%9D%B4%EB%B2%84-%EC%84%A4%EC%B9%98%ED%95%98%EA%B8%B0">simryang.tistory.com</a></li>
</ul>
</div>
</div>
